import { bus, calendar, prohibited, questionMark, stopwatch } from '@/assets';
import type { TermsItem } from '@/types';

const terms: TermsItem[] = [
  {
    title: 'Термін віддачі фото',
    subtitle: 'До 10 днів (в обробці — тільки найкращі кадри\nв моєму авторському стилі).',
    icon: calendar,
  },
  {
    title: 'Термінова обробка (до 24 годин)',
    subtitle: '500 грн до обраного тарифу.\nДоступна тільки за попередньою домовленістю.',
    icon: stopwatch,
  },
  {
    title: 'Виїзд за місто',
    subtitle:
      'Зйомка за межами міста (де не курсує громадський транспорт)\nлише за умови організації або компенсації трансферу.',
    icon: bus,
  },
  {
    title: 'У вартість не входить:',
    subtitle:
      '— оренда студії.\n— послуги візажиста, стиліста, перукаря.\nАле за потреби — порекомендую перевірених майстрів,\nз якими я працюю.',
    icon: prohibited,
  },
  {
    title: 'Питання — це нормально!',
    subtitle:
      'Я завжди зацікавлена в тому,\nщоб результат вийшов не просто красивим, а твоїм.\nТому не соромся питати про локації, образи, настрій.\nАбо саму ідею фотосесії — я з радістю допоможу!',
    icon: questionMark,
  },
];

export default terms;
